const persianLoremContent = [
  "لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد. معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است. از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند.",
  "در حالی که عیسی آل‌کثیر در پرسپولیس شماره ۷۲ را برتن می‌کرد و به او شماره ۷ داده نشد، در تیم سپاهان شماره ۷ به این بازیکن رسید.",
  " کاربران شبکه‌های اجتماعی بار دیگر تیزبینی خود را به رخ کشیدند و نکته بسیار جالبی را در این تصویر شکار کردند که جنجال زیادی را برپا کرده است. ",
  "این کارشناس فوتبال خواهان جریمه نقدی و محرومیت برای هوادارانی شد که شعارهای تحریک آمیز با نام مسی مقابل رونالدو می دهند. او معتقد است که حضور رونالدو در عربستان یک پروژه ملی است و ربطی به النصر ندارد. حضور رونالدو در کشور عربستان از لحاظ فرهنگی، اقتصادی و اجتماعی کمک زیادی می کند و به همین خاطر نباید به این پروژه ملی اهانتی شود یا باعث عصبانیتش شوند.",
  "کمپانی اپل این هفته ۱ میلیون اشتراک فصل جدید MLS را از طریق +Apple TV اعلام کرد، که حق نمایش مسابقات لیگ برتر فوتبال را برای ۱۰ سال آینده دارد. سرمایه‌گزاری این شرکت که ۲٬۵ میلیارد دلار تخمین زده می‌شود، به همکاری نزدیک به ۳۰ ساله لیگ ایالات متحده و ESPN پایان داد.",
  "بسته‌های ارائه شده توسط +Apple TV از ۱۲٬۹۹ دلار در ماه تا ۳۹٬۰۰ دلار برای کل فصل متغیر است. برای کسانی که مشترک +Apple TV نیستند و فقط می‌خواهند بازی‌های MLS را تماشا کنند، قیمت‌ها کمی بالاتر است و از ۱۴٬۹۹ دلار در ماه تا ۴۹٬۰۰ دلار برای کل فصل متغیر است.",
  "حقیقت این است که مسی همچنان به رکوردشکنی‌ها ادامه می‌دهد و تمام توجهاتی که به او می‌شود را توجیه می‌کند. ایوان مارتینیو، استاد بازاریابی ورزشی می‌گوید: «در بزرگترین بازار ورزشی جهان، او با وجود این واقعیت که چهار لیگ اصلی دیگر (NFL ،NBA ،MLB و NHL) مخاطبان و بت‌های خود را دارند، همچنان به جلب توجه ادامه می‌دهد.»",
  "به محض امضای قرارداد با مسی در ماه ژوئن، بیش از ۳۰۰۰۰۰ مشترک جدید به Apple TV+ اضافه شد که بازتابی بیشتر از تاثیر این بازیکن آرژانتینی بر روند رو به جلوی لیگ را نشان می‌دهد. طبق گزارش نشریه اتلتیک، MLS و اپل بخشی از درآمد حاصل از اشتراک در بسته پخش فصل MLS را به مسی ارائه کردند.",
];

const persianLoremTitle = [
  "جریمه هواداران سعودی حامی مسی به خاطر رونالدو!",
  "این یک متن نمونه است.",
  "محتوای پیش فرض برای طراحی است.",
  "متن تستی برای نمایش اطلاعات است.",
  "پاراگراف‌هایی به هم پیوسته برای تست.",
  "کاشت مو «یک روزه» تضمینی | با جدیدترین متد روز دنیا !",
  " لیونل مسی؛ بهترین شریک اپل/ سود شگفت‌انگیز +Apple TV پس از صورتی‌پوش شدن لئو  ",
];

function getRandomPersianLoremContent() {
  const randomIndex = Math.floor(Math.random() * persianLoremContent.length);
  return persianLoremContent[randomIndex];
}

function getRandomPersianLoremTitle() {
  const randomIndex = Math.floor(Math.random() * persianLoremContent.length);
  return persianLoremTitle[randomIndex];
}

function createNewsList() {
  const news = [];

  for (let i = 1; i < 100; i++) {
    news.push({
      title: getRandomPersianLoremContent(),
      content: getRandomPersianLoremTitle(),
      imageUrl: `https://picsum.photos/id/${i + 301}/300/300`,
    });
  }
  let obj = {"news" : news};
  return obj;
}






